app/controllers/members_controller.rb

  def index
    @members = Member.order("number")
---
SELECT "members".* FROM "members"  ORDER BY number

  def show
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 11]]

  def create
    @member = Member.new(params[:member])
    if @member.save
---
INSERT INTO "members" ("name", "full_name", "email", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["full_name", ""], ["email", ""], ["birthday", "1985-01-01"], ["created_at", "2016-05-01 13:17:56.834976"], ["updated_at", "2016-05-01 13:17:56.834976"]]

  def search
    @members = Member.search(params[:q])
---
SELECT "members".* FROM "members" WHERE (name LIKE '%Taro%' OR full_name LIKE '%Taro%')  ORDER BY number